package com.hist.vo;

import java.util.ArrayList;

import org.eclipse.tags.shaded.org.apache.regexp.recompile;

public class HistStudyText {
	
	public String[] histStudyText() {
		
		String[] histStudyText = new String[100];
		
		// 역사 학습
		histStudyText[0] = "&nbsp;진행하세요.";
		histStudyText[1] = "&nbsp;대한민국으로 알려진 국가의 영어명칭은<br>"
				+ "&nbsp;'Republic of Korea'이며,<br>"
				+ "&nbsp;'한국' 또는 'South Korea'라고도 합니다.";
		histStudyText[2] = "&nbsp;대한민국의 국기, 태극기는<br>"
				+ "&nbsp;흰색 바탕에 가운데 태극 모양과<br>"
				+ "&nbsp;네 모서리의 건곤감리 4괘로 구성되어 있습니다.<br><br>"
				+ "&nbsp;흰색 바탕은 '밝음, 순수, 평화'를 나타내고 있으며,<br>"
				+ "&nbsp;중앙의 태극 문양은 파란색의 '음'과 빨간색의 '양'의 조화를 상징하는 것으로<br>"
				+ "&nbsp;우주만물이 음양의 상호작용에 의해 생성되고 발전한다는 것을 형상화 했습니다.<br><br>"
				+ "&nbsp;네 모서리의 4괘는 음과 양이 서로 변화하고 발전하는 모습을 나타내며 <br>"
				+ "&nbsp;각각 좌측 상단의 괘는 '하늘',<br>"
				+ "&nbsp;우측 하단의 괘는 '땅',<br>"
				+ "&nbsp;우측 상단의 괘는 '물',<br>"
				+ "&nbsp;좌측 하단의 괘는 '불'을 상징합니다.";
		histStudyText[3] = "&nbsp;대한민국이 위치한 한반도는 '아시아 동쪽 끝'에 위치해 있으며<br>"
				+ "&nbsp;북쪽은 '조선 민주주의 인민 공화국'과 접하고<br>"
				+ "&nbsp;동쪽과 남쪽, 서쪽의 '3면은 모두 바다'에 둘러싸여 있습니다.<br><br>"
				+ "&nbsp;국토면적은 '약 10만 제곱킬로미터'로<br>"
				+ "&nbsp;비슷한 면적의 국가로는 '아이슬란드'를 꼽을 수 있습니다.";
		histStudyText[4] = "&nbsp;대한민국의 인구 구성은 '한민족'으로 이루어져 있으며,<br>"
				+ "&nbsp;공용어로는 '한국어'를 사용하고 있습니다.<br><br>"
				+ "&nbsp;대한민국에서는 헌법에 의해 종교의 자유도 보장되어,<br>"
				+ "&nbsp;세계적으로도 '종교적 자유도가 높은 국가'입니다.<br>"
				+ "&nbsp;종교를 가지지 않는 무교인이 전체인구의 50%이상을 차지합니다.<br>"
				+ "&nbsp;종교인들은 개신교, 불교, 카톨릭교가 다수를 차지하며<br>"
				+ "&nbsp;그 외 정교회, 이슬람교 등이 있습니다.";
		histStudyText[5] = "&nbsp;아름다운 이 땅 금수강산에 인류가 살기 시작한 시기는<br>"
				+ "&nbsp;'기원전 약 70만년 이전'으로 추정됩니다.<br><br>"
				+ "&nbsp;한반도 일대를 지배한 최초의 국가는<br>"
				+ "&nbsp;홍익인간의 뜻으로 단군이 건국한 '고조선'입니다.<br>";
		histStudyText[6] = "&nbsp;청동기 문화를 바탕으로 한 부족국가로 출발한 고조선은<br>"
				+ "&nbsp;정복활동을 통하여 보다 큰 정치집단으로 발전해 나갔습니다.<br><br>"
				+ "&nbsp;고조선은 후기에 철기를 받아들이면서<br>"
				+ "&nbsp;동방사회의 커다란 '연맹왕국'으로 발전했고,<br>"
				+ "&nbsp;'엄한 법률(고조선 팔조금법 등)'로 사회질서를 유지하면서<br>"
				+ "&nbsp;지배력을 강화했습니다.";
		histStudyText[7] = "&nbsp;고조선은 중국의 통일 왕조인 '한나라'와 자주 충돌을 일으켰는데,<br>"
				+ "&nbsp;기원전 108년에 결국 한무제의 침입으로 왕검성이 함락되면서 멸망했습니다.";
		histStudyText[8] ="&nbsp;고조선이 멸망한 이후<br>"
				+ "&nbsp;철기문화에 기반을 둔 새로운 '연맹국들'이 성립되었습니다.<br>"
				+ "&nbsp;북쪽에서는 '부여, 고구려, 동예 등'이 일어났고,<br>"
				+ "&nbsp;남쪽에서는 마한, 진한, 변한의 '삼한'이 세워졌습니다.<br><br>"
				+ "&nbsp;후에 철기 문화가 널리 보급되면서<br>"
				+ "&nbsp;한반도는 고구려, 백제, 신라 '3국'의 고대국가 시기에 접어듭니다.<br>"
				+ "&nbsp;농업 경제가 진전되고 사회분화가 분명해짐에 따라<br>"
				+ "&nbsp;삼국은 각기 강력한 '중앙집권체제'를 수립했습니다.<br>";
		histStudyText[9] ="&nbsp;1세기 고구려의 '태조왕'은 압록강 유역을 중심으로 여러 부족을 통합하고,<br>"
				+ "&nbsp;대동강 유역까지 진출하며, 정복국가의 기틀을 다졌습니다.";
		histStudyText[10] = "&nbsp;백제는 위례성을 중심으로 '한강 유역'에 자리를 잡고,<br>"
				+ "&nbsp;3세기에 전성기를 맞이했습니다.";
		histStudyText[11] = "&nbsp;신라는 4세기에 '경주 평야 지역'에서 발전하여<br>"
				+ "&nbsp;김씨 중심의 왕권을 중심으로 고대국가로 성장하였습니다.<br>"
				+ "&nbsp;고구려, 백제, 신라 삼국의 발전은 서로 경쟁을 거듭함과 동시에<br>"
				+ "&nbsp;중국의 왕조 교체와 깊은 관계를 가지면서 전개되었습니다.";
		histStudyText[12] = "&nbsp;신라는 당나라와 연합하여 백제와 고구려를 무너뜨리고<br>"
				+ "&nbsp;한반도 지역에서 최초로 통일을 이루어 냈습니다.<br>"
				+ "&nbsp;고대 사회의 발전은 676년에 신라의 삼국통일로 급변하게 됩니다.<br>"
				+ "&nbsp;삼국을 통일한 '통일신라'는 왕권을 강화하며<br>"
				+ "&nbsp;귀족세력을 억누르는 정책을 펼치고<br>"
				+ "&nbsp;넓어진 영토를 통치하기 위해 지역을 분할, 통치했습니다. ";
		histStudyText[13] = "&nbsp;뿐만 아니라 삼국의 문화를 종합하면서도 '새로운 문화'를 꽃피워<br>"
				+ "&nbsp;문학과 과학, 예술 등 각 분야에서 민족문화의 토대가 확립되었습니다.<br>"
				+ "&nbsp;삼국시대에 전래된 불교도 더욱 발전하여<br>"
				+ "&nbsp;불국사와 석굴암과 같은 문화재를 남기기도 했습니다. ";
		histStudyText[14] = "&nbsp;남쪽에 통일신라가 있었다면,<br>"
				+ "&nbsp;북쪽에는 고구려의 옛 전통을 계승한 '발해'가 만주지역을 통치했습니다.<br>"
				+ "&nbsp;당나라와 교류하면서 유교적 정치 제도를 도입한 발해는<br>"
				+ "&nbsp;8, 9세기에 독특한 발전을 보였지만 거란족의 침입으로 인해 패망했습니다.";
		histStudyText[15] = "&nbsp;통일신라 역시 말기에 들어 6두품 세력이 대두하고<br>"
				+ "&nbsp;지방호족의 세력이 성장하면서 '왕권이 약화'되었습니다.<br>"
				+ "&nbsp;그리고 마침내 후고구려, 후백제 그리고 신라로 다시 분열된 후<br>"
				+ "&nbsp;삼국시대가 시작되었습니다. ";
		histStudyText[16] = "&nbsp;918년에 '왕건'은 호족세력을 기반으로 후삼국의 사회 혼란을 수습하고,<br>"
				+ "&nbsp;민족을 재통일하여 '고려'를 세웁니다.<br>"
				+ "&nbsp;호족의 세력을 얻고 건국된 나라인 고려는<br>"
				+ "&nbsp;신라시대 보다 훨씬 더 귀족중심이었습니다.<br><br>"
				+ "&nbsp;유교 정신 사상을 통하여 중앙집권을 유지하였으나<br>"
				+ "&nbsp;신라보다도 문화의 폭이 크게 확대되어<br>"
				+ "&nbsp;지방 호족이 문화의 주인공으로 등장하였고,<br>"
				+ "&nbsp;불교와 유교 문화가 융합되었습니다. ";
		histStudyText[17] = "&nbsp;고려 건국 이후인 10세기부터<br>"
				+ "&nbsp;한반도는 고대사회에서 중세사회로 전환되어 갔습니다.<br><br>"
				+ "&nbsp;'과거제도'가 처음으로 실시되면서 한문학과 역사학도 크게 발달하였는데<br>"
				+ "&nbsp;김부식이 쓴 삼국사기는 현존하는 가장 오래된 역사책이기도 합니다.<br>"
				+ "&nbsp;예술에서는 고려 청자로 알려진 공예부분이 특히 발달하였습니다.";
		histStudyText[18] = "&nbsp;하지만 고려왕조는 12세기 이래로<br>"
				+ "&nbsp;소수의 권문세족들의 '토지사유화' 경향이 나타났습니다.<br>"
				+ "&nbsp;이러한 현상은 고려의 국가재정 공표를 초래하였고,<br>"
				+ "&nbsp;왕조의 기틀을 불안하게 만들었습니다.<br><br>"
				+ "&nbsp;여기에 잇따라 여러 봉기들이 일어났고,<br>"
				+ "&nbsp;나라 바깥에서는 몽골의 침입과 원의 정치적 간섭이 심해져<br>"
				+ "&nbsp;고려는 몰락의 길을 걸을 수 밖에 없었습니다.";
		histStudyText[19] = "&nbsp;외적의 침입과 내적으로도 불안한 상황이었던 15세기 전반에<br>"
				+ "&nbsp;신흥 무인으로 크게 성장한 '이성계'가<br>"
				+ "&nbsp;정도전과 같은 신진사대부와 힘을 합쳐 새로운 국가인 '조선'을 건국하게 됩니다.<br>"
				+ "&nbsp;이들은 고려말 권문세족의 행패에 대응하는 한편<br>"
				+ "&nbsp;외적인 시련을 해결하는 방향에서 출발했습니다. ";
		histStudyText[20] = "&nbsp;15세기 태종, 세종, 세조를 중심으로 권력구조가 개편되었고<br>"
				+ "&nbsp;중앙집권체제가 강화되면서 조선의 국력은 크게 신장했습니다.<br><br>"
				+ "&nbsp;특히 세종대왕 시기에는 국토가 크게 확장되었고<br>"
				+ "&nbsp;산업발전과 '실용학문의 발전'으로 민족문화가 크게 피어났습니다.<br>"
				+ "&nbsp;그중에서도 1446년 세종 28년에 반포된 '훈민정음'은<br>"
				+ "&nbsp;민족문화의 새 장을 열었습니다. ";
		histStudyText[21] = "&nbsp;9대 왕인 성종 시대를 거치면서<br>"
				+ "&nbsp;조선은 완성된 유교 국가의 형태를 갖추었으며<br>"
				+ "&nbsp;고려보다 한층 강화되고 세련된 '중앙집권화 관료제 국가'로 거듭났습니다.<br><br>"
				+ "&nbsp;고려시대의 불교를 대신하여 조선시대 양반 사대부들이 수용한 성리학은<br>"
				+ "&nbsp;16세기에 이르기까지 조선사회와 문화전반을 크게 좌지우지 했습니다.<br>"
				+ "&nbsp;'이황, 이이'와 같은 철학자를 배출하였고<br>"
				+ "&nbsp;윤리적 측면이 강조된 조선의 문화를 발전시켰습니다. ";
		histStudyText[22] = "&nbsp;하지만 16세기 이래<br>"
				+ "&nbsp;훈구세력과 지방의 사림세력 사이에 갈등이 고조되면서<br>"
				+ "&nbsp;조선왕조 역시 동요되어 갔고,<br>"
				+ "&nbsp;'임진왜란과 병자호란 등'의 외세의 침입에도 크게 시달려야 했습니다.<br>"
				+ "&nbsp;19세기 조선의 정세는 세도정치로 말미암아 파국으로 치달았습니다.";
		histStudyText[23] = "&nbsp;정치 기강의 문란으로<br>"
				+ "&nbsp;국가재정은 어려워졌고 농촌 경제는 파탄에 빠졌습니다.<br>"
				+ "&nbsp;의식이 높아진 농민들은 곳곳에서 '민중운동'을 일으켰고<br>"
				+ "&nbsp;카톨릭과 함께 서양 세력이 들어와 조선의 전통적인 양반사회를 위협했습니다. ";
		histStudyText[24] = "&nbsp;조선은 1876년에 마침내 '개항'하였고<br>"
				+ "&nbsp;오랜 유교적 전통 사회로부터 새로운 근대사회로 변화하기 시작하였습니다.<br>"
				+ "&nbsp;정치와 외교, 교통, 교육 등 여러 분야에서 '근대 문물 도입'이 추진되었고<br>"
				+ "&nbsp;1899년에 근대 국가로서의 '대한제국이 수립'되었습니다.<br><br>"
				+ "&nbsp;개혁정치를 실시하여 국가의 위기 상황을 극복하고자 했던 대한제국은<br>"
				+ "&nbsp;끝내 열강의 간섭을 이기지 못하고<br>"
				+ "&nbsp;무력을 앞세운 '일본의 식민지'로 전락하고 말았습니다.";
		histStudyText[25] = "&nbsp;대한민국은 '1910년 일본제국의 식민지로 전락'하는 수모를 겪으며<br>"
				+ "&nbsp;30년 이상 일본의 식민지배를 받았습니다.<br><br>"
				+ "&nbsp;시간이 지나 '1945년 일본제국주의가 태평양전쟁에서 패망'함으로써<br>"
				+ "&nbsp;비로소 독립에 성공하게 됩니다.";
		histStudyText[26] = "&nbsp;독립의 기쁨도 잠시<br>"
				+ "&nbsp;전쟁의 승전국들이 카이로회담, 얄타회담, 포츠담회담에서 합의하여<br>"
				+ "&nbsp;해방과 동시에 남북으로 분열되었습니다.<br><br>"
				+ "&nbsp;이후 '1950년 6월 25일 남북사이에 한국 전쟁이 발발'하게 되고,<br>"
				+ "&nbsp;'1953년 휴전 이후 현재까지<br>"
				+ "&nbsp;남한과 북한으로 분단된 상태'로 유지되고 있습니다.";
		histStudyText[27] = "&nbsp;당시 소련의 영향으로<br>"
				+ "&nbsp;공산주의 체제가 중국을 거쳐 북한까지 들어서게 되나,<br>"
				+ "&nbsp;'대한민국의 1대 대통령인 이승만 정권은 민주주의를 지향'했습니다.<br><br>"
				+ "&nbsp;하지만 1960년대 들어 이승만 정권은 장기집권에 대한 욕심을 버리지 못하고,<br>"
				+ "&nbsp;개헌을 반복하는 등 부정한 정치로 국민들의 분노를 사게 되고<br>"
				+ "&nbsp;이승만은 하와이로 망명하게 됩니다.<br>";
		histStudyText[28] = "&nbsp;이후 '윤보선을 중심으로 제 2공화국이 세워졌으나',<br>"
				+ "&nbsp;박정희 소장을 중심으로 하는 군부세력이 쿠데타를 성공하게 되고<br>"
				+ "&nbsp;장기간의 독재 정권을 수립하게 됩니다.<br><br>"
				+ "&nbsp;'박정희 정권은 철강, 조선, 화학, 자동차 산업에 과감하게 도전'을 감행함으로써<br>"
				+ "&nbsp;'1970년대 빠른 속도로 경제발전을 이룩'했습니다.<br>"
				+ "&nbsp;이 당시 대한민국은 1인당 GDP 1,000달러를 돌파하며<br>"
				+ "&nbsp;신흥 공업국으로 발전을 하는 등 세계적인 위상도 높아졌습니다.";
		histStudyText[29] = "&nbsp;경제적인 발전에도 불구하고<br>"
				+ "&nbsp;'군사 독재 체제'에서 비롯된<br>"
				+ "&nbsp;여러 사회 문제, 문화에 대한 검열과 언론 탄압 등으로<br>"
				+ "&nbsp;지금까지도 비판을 면치 못하고 있습니다.<br><br>"
				+ "&nbsp;박정희 정권 역시 종신집권의 욕구를 뿌리치지 못하여<br>"
				+ "&nbsp;각종 반발이 강하게 이어졌으며<br>"
				+ "&nbsp;결국 박정희는 1979년 암살당하게 됩니다.<br>";
		histStudyText[30] = "&nbsp;'1980년대 접어들어<br>"
				+ "&nbsp;신군부세력으로 등장한 전두환'이 새롭게 정권을 잡았습니다.<br><br>"
				+ "&nbsp;전두환 정부는 강력한 물가안정정책과 시장경제로의 전환을 통한<br>"
				+ "&nbsp;고성장 기조를 유지하여<br>"
				+ "&nbsp;'대한민국의 경제는 최대 호황기를 맞이'하게 됩니다.";
		histStudyText[31] = "&nbsp;그러나 그 과정에서 군대를 동원하여<br>"
				+ "&nbsp;전국 학생 운동회를 체포하거나 반대세력에 대해 고문을 자행하는 등<br>"
				+ "&nbsp;'강압적인 통치'를 펼친 탓에 많은 사회적 트라우마를 남기기도 했습니다.";
		histStudyText[32] = "&nbsp;'1988년에는<br>"
				+ "&nbsp;전 세계 160개국이 참가한 88 서울 올림픽을 개최'하였습니다.<br>"
				+ "&nbsp;특히 당시 동서냉전으로 갈등과 분쟁을 벌여왔던<br>"
				+ "&nbsp;미국과 소련, 서유럽과 동유럽 국가들이<br>"
				+ "&nbsp;한자리에 모이는 세계적으로도 의미 있는 올림픽이었습니다.<br>"
				+ "&nbsp;올림픽 개최는 더욱 선진화 되고,<br>"
				+ "&nbsp;불굴의 신화를 입증하는 대한민국의 국력과<br>"
				+ "&nbsp;한강의 기적을 전 세계에 과시하는 계기가 됩니다.<br><br>"
				+ "&nbsp;이후 1997년 외환위기의 직격탄을 맞고<br>"
				+ "&nbsp;IMF의 원조를 받는 등 국가의 경제 위기가 있었으나,<br>"
				+ "&nbsp;성숙된 국민의 의식으로 위기를 극복했습니다.";
		histStudyText[33] = "&nbsp;그후 김대중 정권에 들어서는 민주주의, 인권, 평화에 관한<br>"
				+ "&nbsp;'한국인 최초로 김대중 대통령이 노벨평화상을 수상'하며<br>"
				+ "&nbsp;선진국으로써의 위상을 남기게 됩니다.";

		return histStudyText;
		
	}	
	
}
